In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from scipy import stats
from scipy import stats

# Importing relevant libraries

# Data Importing and Pre-processing

In [2]:
col = pd.read_csv("cost of living.csv")
gdp = pd.read_csv("gdp.csv")
icp = pd.read_csv("inflation of consumer prices.csv")
cpi = pd.read_csv("consumer price index.csv")
unemployment = pd.read_csv("unemployment rate.csv")

# Importing the datasets

In [3]:
poverty = pd.read_csv(r"C:\Users\ODOSA\Downloads\total-population-in-extreme-poverty - total-population-in-extreme-poverty.csv")

In [4]:
col.head()

# To get the first 5 rows of the Data

,Country,Cost of Living Index,Rent Index,Cost of Living Plus Rent Index,Groceries Index,Restaurant Price Index,Local Purchasing Power Index
0,Switzerland,101.1,46.5,74.9,109.1,97.0,158.7
1,Bahamas,85.0,36.7,61.8,81.6,83.3,54.6
2,Iceland,83.0,39.2,62.0,88.4,86.8,120.3
3,Singapore,76.7,67.2,72.1,74.6,50.4,111.1
4,Barbados,76.6,19.0,48.9,80.8,69.4,43.5

In [5]:
col.isna().sum()

# Getting sum of null values in the column of the data

Country                           0
Cost of Living Index              0
Rent Index                        0
Cost of Living Plus Rent Index    0
Groceries Index                   0
Restaurant Price Index            0
Local Purchasing Power Index      0
dtype: int64

In [6]:
col.info()

# providing consise summary for the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 121 entries, 0 to 120
Data columns (total 7 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   Country                         121 non-null    object
 1   Cost of Living Index            121 non-null    float64
 2   Rent Index                      121 non-null    float64
 3   Cost of Living Plus Rent Index  121 non-null    float64
 4   Groceries Index                 121 non-null    float64
 5   Restaurant Price Index          121 non-null    float64
 6   Local Purchasing Power Index    121 non-null    float64
dtypes: float64(6), object(1)
memory usage: 6.7+ KB

In [7]:
gdp.head()

# To get the first 5 rows of the Data

        Entity  Year GDP per capita
0  Afghanistan  2002       1,280.46
1  Afghanistan  2003       1,292.33
2  Afghanistan  2004       1,260.06
3  Afghanistan  2005       1,352.32
4  Afghanistan  2006       1,366.99

In [8]:
gdp.isna().sum()

# Getting sum of null values in the column of the data

Entity            0
Year              0
GDP per capita    0
dtype: int64

In [9]:
gdp.info()

# providing consise summary for the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6562 entries, 0 to 6561
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Entity          6562 non-null   object
 1   Year            6562 non-null   int64
 2   GDP per capita  6562 non-null   object
dtypes: int64(1), object(2)
memory usage: 153.9+ KB

In [10]:
gdp['Year'] = pd.to_datetime(gdp['Year'], format='%Y')
# Convert the 'Year' column to datetime

gdp['GDP per capita'] = gdp['GDP per capita'].str.replace(',', '').astype(float)
# Convert the 'GDP per capita' column to float64

In [11]:
for column, dtype in gdp.dtypes.items():
    print(f"Column: {column}, Data Type: {dtype}")
    
# confirming change in Datatype

Column: Entity, Data Type: object
Column: Year, Data Type: datetime64[ns]
Column: GDP per capita, Data Type: float64

In [12]:
icp.head()

# To get the first 5 rows of the Data

        Entity  Year  Inflation (annual %)
0  Afghanistan  2005             12.686269
1  Afghanistan  2006              6.784596
2  Afghanistan  2007              8.680571
3  Afghanistan  2008             26.418665
4  Afghanistan  2009             -6.811161

In [13]:
icp.isna().sum()

# Getting sum of null values in the column of the data

Entity                  0
Year                    0
Inflation (annual %)    0
dtype: int64

In [14]:
icp.info()

# providing consise summary for the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9236 entries, 0 to 9235
Data columns (total 3 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Entity                9236 non-null   object
 1   Year                  9236 non-null   int64
 2   Inflation (annual %)  9236 non-null   float64
dtypes: float64(1), int64(1), object(1)
memory usage: 216.6+ KB

In [15]:
icp['Year'] = pd.to_datetime(gdp['Year'], format='%Y')

# Convert the 'Year' column to datetime

In [16]:
for column, dtype in icp.dtypes.items():
    print(f"Column: {column}, Data Type: {dtype}")
    
# confirming change in Datatype

Column: Entity, Data Type: object
Column: Year, Data Type: datetime64[ns]
Column: Inflation (annual %), Data Type: float64

In [17]:
cpi.head()

# To get the first 5 rows of the Data

        Entity  Year Consumer price index
0  Afghanistan  2004                63.52
1  Afghanistan  2005                71.58
2  Afghanistan  2006                76.44
3  Afghanistan  2007                83.07
4  Afghanistan  2008               105.02

In [18]:
cpi.isna().sum()

# Getting sum of null values in the column of the data

Entity                  0
Year                    0
Consumer price index    0
dtype: int64

In [19]:
cpi.info()

# providing consise summary for the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8709 entries, 0 to 8708
Data columns (total 3 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Entity                8709 non-null   object
 1   Year                  8709 non-null   int64
 2   Consumer price index  8709 non-null   object
dtypes: int64(1), object(2)
memory usage: 204.2+ KB

In [20]:
cpi['Year'] = pd.to_datetime(cpi['Year'], format='%Y')
# Convert the 'Year' column to datetime

cpi['Consumer price index'] = cpi['Consumer price index'].str.replace(',', '').astype(float)
# Convert the 'Consumer price index' column to float64

In [21]:
for column, dtype in cpi.dtypes.items():
    print(f"Column: {column}, Data Type: {dtype}")
    
# confirming change in Datatype

Column: Entity, Data Type: object
Column: Year, Data Type: datetime64[ns]
Column: Consumer price index, Data Type: float64

In [22]:
unemployment.head()

# To get the first 5 rows of the Data

,Entity,Year,"Unemployment, total (% of total labor force) (modeled ILO estimate)"
0,Afghanistan,1991,7.942
1,Afghanistan,1992,7.940
2,Afghanistan,1993,7.945
3,Afghanistan,1994,7.947
4,Afghanistan,1995,7.942

In [23]:
unemployment.isna().sum()

# Getting sum of null values in the column of the data

Entity                                                                 0
Year                                                                   0
Unemployment, total (% of total labor force) (modeled ILO estimate)    0
dtype: int64

In [24]:
unemployment.info()

# providing consise summary for the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6431 entries, 0 to 6430
Data columns (total 3 columns):
 #   Column                                                               Non-Null Count  Dtype
---  ------                                                               --------------  -----
 0   Entity                                                               6431 non-null   object
 1   Year                                                                 6431 non-null   int64
 2   Unemployment, total (% of total labor force) (modeled ILO estimate)  6431 non-null   float64
dtypes: float64(1), int64(1), object(1)
memory usage: 150.9+ KB

In [25]:
unemployment['Year'] = pd.to_datetime(unemployment['Year'], format='%Y')
# Convert the 'Year' column to datetime

In [26]:
for column, dtype in icp.dtypes.items():
    print(f"Column: {column}, Data Type: {dtype}")
    
# confirming change in Datatype

Column: Entity, Data Type: object
Column: Year, Data Type: datetime64[ns]
Column: Inflation (annual %), Data Type: float64

In [27]:
poverty.head()

# getting first 5 rows of data

    Entity  Year  $2.15 a day - Number in poverty Unnamed: 3
0  Albania  1996                            16944        NaN
1  Albania  2002                            33337        NaN
2  Albania  2005                            17800        NaN
3  Albania  2008                             5892        NaN
4  Albania  2012                            18003        NaN

In [28]:
poverty.drop(columns = "Unnamed: 3", inplace = True)

# dropping "Unnamed:3" column

In [29]:
poverty.isna().sum()

# Getting sum of null values in the column of the data

Entity                             0
Year                               0
$2.15 a day - Number in poverty    0
dtype: int64

In [30]:
poverty.info()

# providing consise summary for the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2705 entries, 0 to 2704
Data columns (total 3 columns):
 #   Column                           Non-Null Count  Dtype
---  ------                           --------------  -----
 0   Entity                           2705 non-null   object
 1   Year                             2705 non-null   int64
 2   $2.15 a day - Number in poverty  2705 non-null   int64
dtypes: int64(2), object(1)
memory usage: 63.5+ KB

In [31]:
poverty['Year'] = pd.to_datetime(poverty['Year'], format='%Y')
# Convert the 'Year' column to datetime

In [32]:
for column, dtype in icp.dtypes.items():
    print(f"Column: {column}, Data Type: {dtype}")
    
# confirming change in Datatype

Column: Entity, Data Type: object
Column: Year, Data Type: datetime64[ns]
Column: Inflation (annual %), Data Type: float64

In [33]:
african_countries = [
    "Algeria", "Angola", "Benin", "Botswana", "Burkina Faso", "Burundi", 
    "Cabo Verde", "Cameroon", "Central African Republic", "Chad", "Comoros", 
    "Congo", "Djibouti", "Egypt", "Equatorial Guinea", "Eritrea", 
    "Eswatini", "Ethiopia", "Gabon", "Gambia", "Ghana", "Guinea", 
    "Guinea-Bissau", "Ivory Coast", "Kenya", "Lesotho", "Liberia", 
    "Libya", "Madagascar", "Malawi", "Mali", "Mauritania", "Mauritius", 
    "Morocco", "Mozambique", "Namibia", "Niger", "Nigeria", "Rwanda", 
    "Sao Tome and Principe", "Senegal", "Seychelles", "Sierra Leone", 
    "Somalia", "South Africa", "South Sudan", "Sudan", "Tanzania", 
    "Togo", "Tunisia", "Uganda", "Zambia", "Zimbabwe"
]

# create list of african countries

In [34]:
col_af = col[col['Country'].isin(african_countries)]
cpi_af = cpi[cpi['Entity'].isin(african_countries)]
icp_af = icp[icp['Entity'].isin(african_countries)]
gdp_af = gdp[gdp['Entity'].isin(african_countries)]
unemployment_af = unemployment[unemployment['Entity'].isin(african_countries)]
poverty_af = poverty[poverty['Entity'].isin(african_countries)]

# Filtering each dataset for African Countries only

In [35]:
col_af['Country'].unique()

# verifying filtering

array(['Cameroon', 'Zimbabwe', 'Mauritius', 'South Africa', 'Nigeria',
       'Ghana', 'Kenya', 'Botswana', 'Morocco', 'Uganda', 'Algeria',
       'Tunisia', 'Madagascar', 'Tanzania', 'Egypt', 'Libya'],
      dtype=object)

In [36]:
cpi_af['Entity'].unique()

# verifying filtering

array(['Algeria', 'Angola', 'Benin', 'Botswana', 'Burkina Faso',
       'Burundi', 'Cameroon', 'Central African Republic', 'Chad',
       'Comoros', 'Congo', 'Djibouti', 'Egypt', 'Equatorial Guinea',
       'Eswatini', 'Ethiopia', 'Gabon', 'Gambia', 'Ghana', 'Guinea',
       'Guinea-Bissau', 'Kenya', 'Lesotho', 'Liberia', 'Libya',
       'Madagascar', 'Malawi', 'Mali', 'Mauritania', 'Mauritius',
       'Morocco', 'Mozambique', 'Namibia', 'Niger', 'Nigeria', 'Rwanda',
       'Sao Tome and Principe', 'Senegal', 'Seychelles', 'Sierra Leone',
       'South Africa', 'South Sudan', 'Sudan', 'Tanzania', 'Togo',
       'Tunisia', 'Uganda', 'Zambia', 'Zimbabwe'], dtype=object)

In [37]:
icp_af['Entity'].unique()

# verifying filtering

array(['Algeria', 'Angola', 'Benin', 'Botswana', 'Burkina Faso',
       'Burundi', 'Cameroon', 'Central African Republic', 'Chad',
       'Comoros', 'Congo', 'Djibouti', 'Egypt', 'Equatorial Guinea',
       'Eswatini', 'Ethiopia', 'Gabon', 'Gambia', 'Ghana', 'Guinea',
       'Guinea-Bissau', 'Kenya', 'Lesotho', 'Liberia', 'Libya',
       'Madagascar', 'Malawi', 'Mali', 'Mauritania', 'Mauritius',
       'Morocco', 'Mozambique', 'Namibia', 'Niger', 'Nigeria', 'Rwanda',
       'Sao Tome and Principe', 'Senegal', 'Seychelles', 'Sierra Leone',
       'South Africa', 'South Sudan', 'Sudan', 'Tanzania', 'Togo',
       'Tunisia', 'Uganda', 'Zambia', 'Zimbabwe'], dtype=object)

In [38]:
gdp_af['Entity'].unique()

# verifying filtering

array(['Algeria', 'Angola', 'Benin', 'Botswana', 'Burkina Faso',
       'Burundi', 'Cameroon', 'Central African Republic', 'Chad',
       'Comoros', 'Congo', 'Djibouti', 'Egypt', 'Equatorial Guinea',
       'Eswatini', 'Ethiopia', 'Gabon', 'Gambia', 'Ghana', 'Guinea',
       'Guinea-Bissau', 'Kenya', 'Lesotho', 'Liberia', 'Libya',
       'Madagascar', 'Malawi', 'Mali', 'Mauritania', 'Mauritius',
       'Morocco', 'Mozambique', 'Namibia', 'Niger', 'Nigeria', 'Rwanda',
       'Sao Tome and Principe', 'Senegal', 'Seychelles', 'Sierra Leone',
       'Somalia', 'South Africa', 'Sudan', 'Tanzania', 'Togo', 'Tunisia',
       'Uganda', 'Zambia', 'Zimbabwe'], dtype=object)

In [39]:
unemployment_af['Entity'].unique()

# verifying filtering

array(['Algeria', 'Angola', 'Benin', 'Botswana', 'Burkina Faso',
       'Burundi', 'Cameroon', 'Central African Republic', 'Chad',
       'Comoros', 'Congo', 'Djibouti', 'Egypt', 'Equatorial Guinea',
       'Eritrea', 'Eswatini', 'Ethiopia', 'Gabon', 'Gambia', 'Ghana',
       'Guinea', 'Guinea-Bissau', 'Kenya', 'Lesotho', 'Liberia', 'Libya',
       'Madagascar', 'Malawi', 'Mali', 'Mauritania', 'Mauritius',
       'Morocco', 'Mozambique', 'Namibia', 'Niger', 'Nigeria', 'Rwanda',
       'Sao Tome and Principe', 'Senegal', 'Sierra Leone', 'Somalia',
       'South Africa', 'South Sudan', 'Sudan', 'Tanzania', 'Togo',
       'Tunisia', 'Uganda', 'Zambia', 'Zimbabwe'], dtype=object)

In [40]:
poverty_af['Entity'].unique()

# verifying filtering

array(['Algeria', 'Angola', 'Benin', 'Botswana', 'Burkina Faso',
       'Burundi', 'Cameroon', 'Central African Republic', 'Chad',
       'Comoros', 'Congo', 'Djibouti', 'Egypt', 'Eswatini', 'Ethiopia',
       'Gabon', 'Gambia', 'Ghana', 'Guinea', 'Guinea-Bissau', 'Kenya',
       'Lesotho', 'Liberia', 'Madagascar', 'Malawi', 'Mali', 'Mauritania',
       'Mauritius', 'Morocco', 'Mozambique', 'Namibia', 'Niger',
       'Nigeria', 'Rwanda', 'Sao Tome and Principe', 'Senegal',
       'Seychelles', 'Sierra Leone', 'South Africa', 'South Sudan',
       'Sudan', 'Tanzania', 'Togo', 'Tunisia', 'Uganda', 'Zambia',
       'Zimbabwe'], dtype=object)

# 1. Analyzing the Relationship Between Rising Costs of Living and Inflation

In [41]:
col_af.rename(columns={'Country': 'Entity'}, inplace=True)

# Rename country column to entity

C:\Users\ODOSA\anaconda3\lib\site-packages\pandas\core\frame.py:5039: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().rename(

In [42]:
col_af.head()

# Check

,Entity,Cost of Living Index,Rent Index,Cost of Living Plus Rent Index,Groceries Index,Restaurant Price Index,Local Purchasing Power Index
71,Cameroon,37.3,16.9,27.5,34.6,35.3,10.5
72,Zimbabwe,37.2,10.0,24.1,35.5,26.7,26.1
73,Mauritius,37.1,10.0,24.1,40.7,26.5,43.2
77,South Africa,34.5,11.5,23.5,29.7,29.5,102.8
85,Nigeria,31.4,22.1,27.0,37.5,20.6,11.0

In [59]:
cost_inflation = pd.merge(col_af, icp_af, on='Entity', how='inner')
cost_inflation

# merging data

,Entity,Cost of Living Index,Rent Index,Cost of Living Plus Rent Index,Groceries Index,Restaurant Price Index,Local Purchasing Power Index,Year,Inflation (annual %)
0,Cameroon,37.3,16.9,27.5,34.6,35.3,10.5,2010-01-01,-1.101591
1,Cameroon,37.3,16.9,27.5,34.6,35.3,10.5,2011-01-01,5.858086
2,Cameroon,37.3,16.9,27.5,34.6,35.3,10.5,2012-01-01,4.014030
3,Cameroon,37.3,16.9,27.5,34.6,35.3,10.5,2013-01-01,8.092918
4,Cameroon,37.3,16.9,27.5,34.6,35.3,10.5,2014-01-01,10.384748
...,...,...,...,...,...,...,...,...,...
836,Libya,20.4,4.3,12.7,22.2,15.2,42.0,2020-01-01,13.170204
837,Libya,20.4,4.3,12.7,22.2,15.2,42.0,2021-01-01,-2.162179
838,Libya,20.4,4.3,12.7,22.2,15.2,42.0,2022-01-01,1.447037
839,Libya,20.4,4.3,12.7,22.2,15.2,42.0,1990-01-01,2.868330
840,Libya,20.4,4.3,12.7,22.2,15.2,42.0,1991-01-01,4.510302

In [60]:
cost_inflation["Entity"].unique()

# getting unoque values in the "Entity" column

array(['Cameroon', 'Zimbabwe', 'Mauritius', 'South Africa', 'Nigeria',
       'Ghana', 'Kenya', 'Botswana', 'Morocco', 'Uganda', 'Algeria',
       'Tunisia', 'Madagascar', 'Tanzania', 'Egypt', 'Libya'],
      dtype=object)

In [61]:
cost_inflation.isna().sum()

# getting the sum of the null values in each column

Entity                              0
Cost of Living Index                0
Rent Index                          0
Cost of Living Plus Rent Index      0
Groceries Index                     0
Restaurant Price Index              0
Local Purchasing Power Index        0
Year                              201
Inflation (annual %)                0
dtype: int64

In [62]:
cost_inflation.dropna(inplace=True)

# dropping all null values

In [63]:
cost_inflation.isna().any()

# verifying drop

Entity                            False
Cost of Living Index              False
Rent Index                        False
Cost of Living Plus Rent Index    False
Groceries Index                   False
Restaurant Price Index            False
Local Purchasing Power Index      False
Year                              False
Inflation (annual %)              False
dtype: bool

In [64]:
cost_inflation.describe()

# Descriptive statistics for numeric columns

,Cost of Living Index,Rent Index,Cost of Living Plus Rent Index,Groceries Index,Restaurant Price Index,Local Purchasing Power Index,Inflation (annual %)
count,640.000000,640.000000,640.000000,640.000000,640.000000,640.000000,640.000000
mean,29.122344,9.245781,19.595938,31.000312,21.215156,29.279844,10.413399
std,5.280103,5.514764,4.832802,6.207893,6.079778,15.335615,12.670080
min,20.400000,3.700000,12.700000,21.200000,14.000000,10.500000,-9.797647
25%,24.500000,4.300000,16.500000,24.100000,15.200000,15.600000,3.636863
50%,30.100000,7.800000,18.900000,31.000000,20.700000,29.900000,7.982759
75%,31.400000,10.200000,24.100000,36.800000,26.500000,42.000000,12.390834
max,37.300000,22.100000,27.500000,40.700000,35.300000,64.400000,122.874510

In [73]:
cost_inflation.to_csv(r"cost_inflation.csv", index=False)

# exporting merged data to my file directory

In [66]:
gdp_consumer_price_index = pd.merge(cpi_af, gdp_af, on=['Entity', 'Year'], how='inner')

gdp_consumer_price_index

# merging data

        Entity       Year  Consumer price index  GDP per capita
0      Algeria 1990-01-01                 15.52         8828.87
1      Algeria 1991-01-01                 19.54         8517.38
2      Algeria 1992-01-01                 25.72         8471.53
3      Algeria 1993-01-01                 31.01         8109.88
4      Algeria 1994-01-01                 40.01         7869.27
...        ...        ...                   ...             ...
1412  Zimbabwe 2018-01-01                116.71         2399.62
1413  Zimbabwe 2019-01-01                414.68         2203.40
1414  Zimbabwe 2020-01-01               2725.31         1990.32
1415  Zimbabwe 2021-01-01               5411.00         2115.14
1416  Zimbabwe 2022-01-01              11076.60         2207.96

[1417 rows x 4 columns]

In [67]:
gdp_consumer_price_index.isna().sum()

# getting the sum of the null values in each column

Entity                  0
Year                    0
Consumer price index    0
GDP per capita          0
dtype: int64

In [72]:
gdp_consumer_price_index.to_csv(r"gdp_consumer_price_index.csv", index=False)

# exporting merged data to my file directory

# 2. Assessing the impact of inflation on purchasing power and economic stability

In [49]:
df = cpi_af.merge(gdp, on=['Entity', 'Year'])
df = df.merge(icp_af, on=['Entity', 'Year'])
df = df.merge(unemployment_af, on=['Entity', 'Year'])
df = df.merge(poverty_af, on=['Entity', 'Year'])

# Merging datasets

In [50]:
df.head()

# getting the first 5 rows of the dataset

,Entity,Year,Consumer price index,GDP per capita,Inflation (annual %),"Unemployment, total (% of total labor force) (modeled ILO estimate)",$2.15 a day - Number in poverty
0,Algeria,1995-01-01,51.93,8013.12,6.542510,31.840,1742570
1,Algeria,1995-01-01,51.93,8013.12,4.784447,31.840,1742570
2,Algeria,2011-01-01,104.52,11113.97,4.950162,9.960,0
3,Angola,2000-01-01,2.91,4728.37,25.754265,16.562,3526425
4,Angola,2008-01-01,76.81,7866.18,4145.106000,16.013,3224262

In [51]:
df.isna().sum()

# gettin the sum of null values

Entity                                                                 0
Year                                                                   0
Consumer price index                                                   0
GDP per capita                                                         0
Inflation (annual %)                                                   0
Unemployment, total (% of total labor force) (modeled ILO estimate)    0
$2.15 a day - Number in poverty                                        0
dtype: int64

In [52]:
df["Entity"].unique()

# getting the unique values in the "Entity" columns

array(['Algeria', 'Angola', 'Benin', 'Botswana', 'Burkina Faso',
       'Burundi', 'Cameroon', 'Central African Republic', 'Chad', 'Congo',
       'Djibouti', 'Egypt', 'Eswatini', 'Ethiopia', 'Gabon', 'Gambia',
       'Ghana', 'Guinea', 'Guinea-Bissau', 'Kenya', 'Lesotho', 'Liberia',
       'Madagascar', 'Malawi', 'Mali', 'Mauritania', 'Mauritius',
       'Morocco', 'Mozambique', 'Namibia', 'Niger', 'Nigeria'],
      dtype=object)

In [53]:
df.describe()

# Descriptive statistics for numeric columns

,Consumer price index,GDP per capita,Inflation (annual %),"Unemployment, total (% of total labor force) (modeled ILO estimate)",$2.15 a day - Number in poverty
count,225.000000,225.000000,225.000000,225.000000,2.250000e+02
mean,102.401956,4374.955467,27.907156,7.377364,9.618702e+06
std,65.161979,4219.725752,276.036461,6.584414,1.494037e+07
min,2.910000,671.540000,-16.859692,0.320000,0.000000e+00
25%,61.930000,1517.700000,2.737239,3.100000,8.854070e+05
50%,100.000000,2849.820000,6.542510,4.961000,5.466798e+06
75%,119.530000,5089.780000,11.784484,9.704000,1.025217e+07
max,418.340000,22143.830000,4145.106000,31.840000,6.523411e+07

In [55]:
df.to_csv(r"merged_data.csv", index=False)

# exporting merged data to my file directory

# 3. Investigate the Impact on Business Operations and Investment Decisions

In [75]:
fdi_inflow_as_share_of_gdp = pd.read_csv(r"C:\Users\ODOSA\Downloads\Food Prices Analysis\fdi_net_inflow_as_share _of_gdp.csv")
fdi_outflow_as_share_of_gdp = pd.read_csv(r"C:\Users\ODOSA\Downloads\Food Prices Analysis\fdi_net_outflow_as_share_of_gdp.csv")
annual_gdp_growth = pd.read_csv(r"C:\Users\ODOSA\Downloads\Food Prices Analysis\annual_gdp_growth.csv")

# Importing data

In [76]:
fdi_inflow_as_share_of_gdp.head()

# getting first 5 rows of data

        Entity Code  Year  Foreign direct investment, net inflows (% of GDP)
0  Afghanistan  AFG  1970                                           0.013151
1  Afghanistan  AFG  1971                                           0.024575
2  Afghanistan  AFG  1972                                           0.009401
3  Afghanistan  AFG  1973                                           0.015577
4  Afghanistan  AFG  1976                                           0.001565

In [77]:
fdi_inflow_as_share_of_gdp.isna().sum()

# Checking the total sum of null values in each columns of the dataset

Entity                                                 0
Code                                                 679
Year                                                   0
Foreign direct investment, net inflows (% of GDP)      0
dtype: int64

In [78]:
fdi_inflow_as_share_of_gdp.info()

# providing consise summary of the data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9257 entries, 0 to 9256
Data columns (total 4 columns):
 #   Column                                             Non-Null Count  Dtype
---  ------                                             --------------  -----
 0   Entity                                             9257 non-null   object
 1   Code                                               8578 non-null   object
 2   Year                                               9257 non-null   int64
 3   Foreign direct investment, net inflows (% of GDP)  9257 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 289.4+ KB

In [79]:
fdi_inflow_as_share_of_gdp['Year'] = pd.to_datetime(fdi_inflow_as_share_of_gdp['Year'], format='%Y')

# Convert the 'Year' column to datetime

In [81]:
for column, dtype in fdi_inflow_as_share_of_gdp.dtypes.items():
    print(f"Column: {column}, Data Type: {dtype}")
    
# confirming change in Datatype

Column: Entity, Data Type: object
Column: Code, Data Type: object
Column: Year, Data Type: datetime64[ns]
Column: Foreign direct investment, net inflows (% of GDP), Data Type: float64

In [82]:
fdi_outflow_as_share_of_gdp.head()

# getting first 5 rows of data

        Entity Code  Year  Foreign direct investment, net outflows (% of GDP)
0  Afghanistan  AFG  1979                                           0.000000
1  Afghanistan  AFG  1980                                           0.000000
2  Afghanistan  AFG  1981                                           0.000000
3  Afghanistan  AFG  2003                                           0.022119
4  Afghanistan  AFG  2004                                          -0.013397

In [83]:
fdi_outflow_as_share_of_gdp.isna().sum()

# Checking the total sum of null values in each columns of the dataset

Entity                                                  0
Code                                                  614
Year                                                    0
Foreign direct investment, net outflows (% of GDP)      0
dtype: int64

In [84]:
fdi_outflow_as_share_of_gdp.info()

# providing consise summary of the data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7863 entries, 0 to 7862
Data columns (total 4 columns):
 #   Column                                              Non-Null Count  Dtype
---  ------                                              --------------  -----
 0   Entity                                              7863 non-null   object
 1   Code                                                7249 non-null   object
 2   Year                                                7863 non-null   int64
 3   Foreign direct investment, net outflows (% of GDP)  7863 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 245.8+ KB

In [85]:
fdi_outflow_as_share_of_gdp['Year'] = pd.to_datetime(fdi_inflow_as_share_of_gdp['Year'], format='%Y')

# Convert the 'Year' column to datetime

In [86]:
for column, dtype in fdi_outflow_as_share_of_gdp.dtypes.items():
    print(f"Column: {column}, Data Type: {dtype}")
    
# confirming change in Datatype

Column: Entity, Data Type: object
Column: Code, Data Type: object
Column: Year, Data Type: datetime64[ns]
Column: Foreign direct investment, net outflows (% of GDP), Data Type: float64

In [87]:
annual_gdp_growth.head()

# getting first 5 rows of data

        Entity Code  Year  17.13.1 - Annual GDP growth (%) - NY_GDP_MKTP_KD_ZG
0  Afghanistan  AFG  2003                                               8.83
1  Afghanistan  AFG  2004                                               1.41
2  Afghanistan  AFG  2005                                              11.23
3  Afghanistan  AFG  2006                                               5.36
4  Afghanistan  AFG  2007                                              13.83

In [88]:
annual_gdp_growth.isna().sum()

# Checking the total sum of null values in each columns of the dataset

Entity                                                   0
Code                                                   299
Year                                                     0
17.13.1 - Annual GDP growth (%) - NY_GDP_MKTP_KD_ZG      0
dtype: int64

In [89]:
annual_gdp_growth.info()

# providing consise summary of the data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5006 entries, 0 to 5005
Data columns (total 4 columns):
 #   Column                                               Non-Null Count  Dtype
---  ------                                               --------------  -----
 0   Entity                                               5006 non-null   object
 1   Code                                                 4707 non-null   object
 2   Year                                                 5006 non-null   int64
 3   17.13.1 - Annual GDP growth (%) - NY_GDP_MKTP_KD_ZG  5006 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 156.6+ KB

In [90]:
annual_gdp_growth['Year'] = pd.to_datetime(annual_gdp_growth['Year'], format='%Y')

# Convert the 'Year' column to datetime

In [91]:
for column, dtype in annual_gdp_growth.dtypes.items():
    print(f"Column: {column}, Data Type: {dtype}")
    
# confirming change in Datatype

Column: Entity, Data Type: object
Column: Code, Data Type: object
Column: Year, Data Type: datetime64[ns]
Column: 17.13.1 - Annual GDP growth (%) - NY_GDP_MKTP_KD_ZG, Data Type: float64

In [92]:
fdi_inflow_as_share_of_gdp.drop(columns='Code', inplace=True)
fdi_outflow_as_share_of_gdp.drop(columns='Code', inplace=True)
annual_gdp_growth.drop(columns='Code', inplace=True)

# Dropping the "Code" column in all of the dataset

In [94]:
fdi_inflow_as_share_of_gdp_af = fdi_inflow_as_share_of_gdp[fdi_inflow_as_share_of_gdp['Entity'].isin(african_countries)]
fdi_outflow_as_share_of_gdp_af = fdi_outflow_as_share_of_gdp[fdi_outflow_as_share_of_gdp['Entity'].isin(african_countries)]
annual_gdp_growth_af = annual_gdp_growth[annual_gdp_growth['Entity'].isin(african_countries)]

# Filtering each dataset for African Countries only

In [95]:
fdi_inflow_as_share_of_gdp_af["Entity"].unique()

# getting unique values in the "Entity" column to comfirm filtering

array(['Algeria', 'Angola', 'Benin', 'Botswana', 'Burkina Faso',
       'Burundi', 'Cameroon', 'Central African Republic', 'Chad',
       'Comoros', 'Congo', 'Djibouti', 'Egypt', 'Equatorial Guinea',
       'Eritrea', 'Eswatini', 'Ethiopia', 'Gabon', 'Gambia', 'Ghana',
       'Guinea', 'Guinea-Bissau', 'Kenya', 'Lesotho', 'Liberia', 'Libya',
       'Madagascar', 'Malawi', 'Mali', 'Mauritania', 'Mauritius',
       'Morocco', 'Mozambique', 'Namibia', 'Niger', 'Nigeria', 'Rwanda',
       'Sao Tome and Principe', 'Senegal', 'Seychelles', 'Sierra Leone',
       'Somalia', 'South Africa', 'South Sudan', 'Sudan', 'Tanzania',
       'Togo', 'Tunisia', 'Uganda', 'Zambia', 'Zimbabwe'], dtype=object)

In [96]:
fdi_outflow_as_share_of_gdp_af["Entity"].unique()

# getting unique values in the "Entity" column to confirm filtering

array(['Algeria', 'Angola', 'Benin', 'Botswana', 'Burkina Faso',
       'Burundi', 'Cameroon', 'Central African Republic', 'Chad',
       'Comoros', 'Congo', 'Egypt', 'Equatorial Guinea', 'Eritrea',
       'Eswatini', 'Ethiopia', 'Gabon', 'Gambia', 'Ghana', 'Guinea',
       'Guinea-Bissau', 'Kenya', 'Lesotho', 'Liberia', 'Libya',
       'Madagascar', 'Malawi', 'Mali', 'Mauritania', 'Mauritius',
       'Morocco', 'Mozambique', 'Namibia', 'Niger', 'Nigeria', 'Rwanda',
       'Sao Tome and Principe', 'Senegal', 'Seychelles', 'Sierra Leone',
       'South Africa', 'South Sudan', 'Sudan', 'Tanzania', 'Togo',
       'Tunisia', 'Uganda', 'Zambia', 'Zimbabwe'], dtype=object)

In [97]:
annual_gdp_growth_af["Entity"].unique()

# getting unique values in the "Entity" column to confirm filtering

array(['Algeria', 'Angola', 'Benin', 'Botswana', 'Burkina Faso',
       'Burundi', 'Cameroon', 'Central African Republic', 'Chad',
       'Comoros', 'Congo', 'Djibouti', 'Egypt', 'Equatorial Guinea',
       'Eritrea', 'Eswatini', 'Ethiopia', 'Gabon', 'Gambia', 'Ghana',
       'Guinea', 'Guinea-Bissau', 'Kenya', 'Lesotho', 'Liberia', 'Libya',
       'Madagascar', 'Malawi', 'Mali', 'Mauritania', 'Mauritius',
       'Morocco', 'Mozambique', 'Namibia', 'Niger', 'Nigeria', 'Rwanda',
       'Sao Tome and Principe', 'Senegal', 'Seychelles', 'Sierra Leone',
       'Somalia', 'South Africa', 'South Sudan', 'Sudan', 'Tanzania',
       'Togo', 'Tunisia', 'Uganda', 'Zambia', 'Zimbabwe'], dtype=object)

In [98]:
annual_gdp_growth_af.rename(columns={'17.13.1 - Annual GDP growth (%) - NY_GDP_MKTP_KD_ZG': 'Annual GDP growth (%)'}, inplace=True)

 # Rename '17.13.1 - Annual GDP growth (%) - NY_GDP_MKTP_KD_ZG' to 'Annual GDP growth (%)'

C:\Users\ODOSA\anaconda3\lib\site-packages\pandas\core\frame.py:5039: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().rename(

In [99]:
annual_gdp_growth_af.head()

     Entity       Year  Annual GDP growth (%)
42  Algeria 2000-01-01                    3.8
43  Algeria 2001-01-01                    3.0
44  Algeria 2002-01-01                    5.6
45  Algeria 2003-01-01                    7.2
46  Algeria 2004-01-01                    4.3

In [101]:
col_fdi_inflows = col_af.merge(fdi_inflow_as_share_of_gdp_af, on=['Entity'])

# Merginig datasets

In [103]:
col_fdi_inflows.head()

# getting first 5 rows of data

,Entity,Cost of Living Index,Rent Index,Cost of Living Plus Rent Index,Groceries Index,Restaurant Price Index,Local Purchasing Power Index,Year,"Foreign direct investment, net inflows (% of GDP)"
0,Cameroon,37.3,16.9,27.5,34.6,35.3,10.5,1970-01-01,1.389834
1,Cameroon,37.3,16.9,27.5,34.6,35.3,10.5,1971-01-01,0.137436
2,Cameroon,37.3,16.9,27.5,34.6,35.3,10.5,1972-01-01,0.220257
3,Cameroon,37.3,16.9,27.5,34.6,35.3,10.5,1973-01-01,0.163038
4,Cameroon,37.3,16.9,27.5,34.6,35.3,10.5,1974-01-01,1.001198

In [105]:
col_fdi_inflows.isna().sum()

# checking for null values

Entity                                               0
Cost of Living Index                                 0
Rent Index                                           0
Cost of Living Plus Rent Index                       0
Groceries Index                                      0
Restaurant Price Index                               0
Local Purchasing Power Index                         0
Year                                                 0
Foreign direct investment, net inflows (% of GDP)    0
dtype: int64

In [107]:
col_fdi_inflows.describe()

# Descriptive statistics for numeric columns

,Cost of Living Index,Rent Index,Cost of Living Plus Rent Index,Groceries Index,Restaurant Price Index,Local Purchasing Power Index,"Foreign direct investment, net inflows (% of GDP)"
count,798.000000,798.000000,798.000000,798.000000,798.000000,798.000000,798.000000
mean,29.952130,9.090351,19.946992,31.108396,21.717293,32.983459,1.564456
std,4.955543,4.782637,4.310698,5.269299,6.064157,22.997716,1.989260
min,20.400000,3.700000,12.700000,21.200000,14.000000,10.500000,-10.774799
25%,28.100000,6.100000,16.900000,29.300000,16.200000,17.800000,0.284263
50%,30.100000,8.400000,18.900000,31.000000,21.600000,26.100000,1.036727
75%,34.500000,10.200000,24.100000,35.500000,26.700000,38.600000,2.209828
max,37.300000,22.100000,27.500000,40.700000,35.300000,102.800000,15.594140

In [122]:
col_fdi_inflows.to_csv(r"col_fdi_inflows.csv", index=False)

# exporting merged data to my file directory

In [110]:
gdp_growth_fdi_inflows = annual_gdp_growth_af.merge(fdi_inflow_as_share_of_gdp_af, on=['Entity', 'Year'])

# Merginig datasets

In [111]:
gdp_growth_fdi_inflows.head()

# getting first 5 rows of data

,Entity,Year,Annual GDP growth (%),"Foreign direct investment, net inflows (% of GDP)"
0,Algeria,2000-01-01,3.80,0.511221
1,Algeria,2001-01-01,3.00,2.033266
2,Algeria,2002-01-01,5.60,1.876239
3,Algeria,2003-01-01,7.20,0.939901
4,Algeria,2004-01-01,4.30,1.036825
...,...,...,...,...
1105,Zimbabwe,2018-01-01,5.01,2.101721
1106,Zimbabwe,2019-01-01,-6.33,1.142806
1107,Zimbabwe,2020-01-01,-7.82,0.699033
1108,Zimbabwe,2021-01-01,8.47,0.881174
1109,Zimbabwe,2022-01-01,6.52,1.247870

In [112]:
gdp_growth_fdi_inflows.isna().sum()

# checking for null values

Entity                                               0
Year                                                 0
Annual GDP growth (%)                                0
Foreign direct investment, net inflows (% of GDP)    0
dtype: int64

In [113]:
gdp_growth_fdi_inflows.describe()

# Descriptive statistics for numeric columns

,Annual GDP growth (%),"Foreign direct investment, net inflows (% of GDP)"
count,1110.000000,1110.000000
mean,3.897874,4.192429
std,6.364120,7.791634
min,-50.340000,-17.292236
25%,2.067500,0.982091
50%,4.150000,2.398889
75%,6.170000,4.757189
max,86.830000,103.337390

In [121]:
gdp_growth_fdi_inflows.to_csv(r"gdp_growth_fdi_inflows.csv", index=False)

# exporting merged data to my file directory

In [115]:
icp_fdi_inflows = icp_af.merge(fdi_inflow_as_share_of_gdp_af, on=['Entity', 'Year'])

# Merginig datasets

In [117]:
icp_fdi_inflows.head()

# getting the first 5 rows

,Entity,Year,Inflation (annual %),"Foreign direct investment, net inflows (% of GDP)"
0,Algeria,2016-01-01,6.600000,1.023696
1,Algeria,2016-01-01,4.268954,1.023696
2,Algeria,2017-01-01,2.626642,0.723260
3,Algeria,2017-01-01,3.961800,0.723260
4,Algeria,2018-01-01,3.656307,0.838208

In [118]:
icp_fdi_inflows.isna().sum()

# Checking for null values

Entity                                               0
Year                                                 0
Inflation (annual %)                                 0
Foreign direct investment, net inflows (% of GDP)    0
dtype: int64

In [119]:
icp_fdi_inflows.describe()

# Descriptive statistics for numeric columns

       Inflation (annual %)  Foreign direct investment, net inflows (% of GDP)
count           1560.000000                                        1560.000000
mean              15.510224                                           3.094039
std              132.571457                                           7.154550
min              -17.640425                                         -17.292236
25%                2.601345                                           0.468169
50%                6.265068                                           1.644781
75%               11.569397                                           3.633673
max             4145.106000                                         161.823760

In [120]:
icp_fdi_inflows.to_csv(r"icp_fdi_inflows.csv", index=False)

# exporting merged data to my file directory